In [84]:
import numpy as np
import pandas as pd

In [85]:
df=pd.read_csv("BlackFriday.csv")

In [86]:
len((df["Product_ID"]))

537577

In [87]:
len(np.unique(df["Age"]))

7

In [88]:
print("occupation =",len(np.unique(df["Occupation"])))

occupation = 21

In [89]:
print("Category =",len(np.unique(df["City_Category"])),"\nStay_in_Current_City_Year=",len(np.unique(df["Stay_In_Current_City_Years"])))

Category = 3
Stay_in_Current_City_Year= 5

In [90]:
print("Product Category 1=",len(np.unique(df["Product_Category_1"])))

Product Category 1= 18

In [91]:
print("Product Category 2=",len(np.unique(df["Product_Category_2"])))

Product Category 2= 167003

In [92]:
print("Product Category 3=",len(np.unique(df["Product_Category_3"])))

Product Category 3= 373314

In [93]:
np.unique(df["Product_Category_1"])

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18], dtype=int64)

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
User_ID                       537577 non-null int64
Product_ID                    537577 non-null object
Gender                        537577 non-null object
Age                           537577 non-null object
Occupation                    537577 non-null int64
City_Category                 537577 non-null object
Stay_In_Current_City_Years    537577 non-null object
Marital_Status                537577 non-null int64
Product_Category_1            537577 non-null int64
Product_Category_2            370591 non-null float64
Product_Category_3            164278 non-null float64
Purchase                      537577 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [95]:
df["Product_Category_2"].fillna(value=int(df["Product_Category_2"].mean()),inplace=True)

In [97]:
df.empty

False

In [98]:
df["Product_Category_3"].fillna(value=int(df["Product_Category_3"].mean()),inplace=True)

In [99]:
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,9.0,12.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,9.0,12.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,12.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,9.0,12.0,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
537572,1004737,P00193542,M,36-45,16,C,1,0,1,2.0,12.0,11664
537573,1004737,P00111142,M,36-45,16,C,1,0,1,15.0,16.0,19196
537574,1004737,P00345942,M,36-45,16,C,1,0,8,15.0,12.0,8043
537575,1004737,P00285842,M,36-45,16,C,1,0,5,9.0,12.0,7172
537576,1004737,P00118242,M,36-45,16,C,1,0,5,8.0,12.0,6875

In [100]:
print("Product Category 3=",(np.unique(df["Product_Category_3"])))

Product Category 3= [ 3.  4.  5.  6.  8.  9. 10. 11. 12. 13. 14. 15. 16. 17. 18.]

In [103]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,9.0,12.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,9.0,12.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,12.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,9.0,12.0,7969

In [110]:
len(df["Product_Category_3"][df["Product_Category_3"].isnull()==False])

537577

In [111]:
len(df["Product_Category_3"])

537577

In [113]:
(df["Product_Category_2"][df["Product_Category_2"].isnull()])

Series([], Name: Product_Category_2, dtype: float64)

In [114]:
(df["Product_Category_1"][df["Product_Category_1"].isnull()])

Series([], Name: Product_Category_1, dtype: int64)

In [115]:
(df["Gender"][df["Gender"].isnull()])

Series([], Name: Gender, dtype: object)

In [116]:
(df["Occupation"][df["Occupation"].isnull()])

Series([], Name: Occupation, dtype: int64)

In [117]:
(df["Age"][df["Age"].isnull()])

Series([], Name: Age, dtype: object)

In [118]:
(df["City_Category"][df["City_Category"].isnull()])

Series([], Name: City_Category, dtype: object)

In [119]:
(df["Stay_In_Current_City_Years"][df["Stay_In_Current_City_Years"].isnull()])

Series([], Name: Stay_In_Current_City_Years, dtype: object)

In [120]:
(df["Purchase"][df["Purchase"].isnull()])

Series([], Name: Purchase, dtype: int64)

In [123]:
df.drop(columns=["User_ID"],axis=1,inplace=True)

In [125]:
from sklearn.preprocessing import LabelEncoder

In [126]:
encoder=LabelEncoder()

In [128]:
df.head(2)

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,F,0-17,10,A,2,0,3,9.0,12.0,8370
1,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200

In [140]:
df["Product_ID"]=encoder.fit_transform(df["Product_ID"])
df["Gender"]=encoder.fit_transform(df["Gender"])
df["Age"]=encoder.fit_transform(df["Age"])
df["Occupation"]=encoder.fit_transform(df["Occupation"])
df["City_Category"]=encoder.fit_transform(df["City_Category"])
df["Stay_In_Current_City_Years"]=encoder.fit_transform(df["Stay_In_Current_City_Years"])
df["Marital_Status"]=encoder.fit_transform(df["Marital_Status"])
df["Product_Category_1"]=encoder.fit_transform(df["Product_Category_1"])
df["Product_Category_2"]=encoder.fit_transform(df["Product_Category_2"])
df["Product_Category_3"]=encoder.fit_transform(df["Product_Category_3"])
df["Purchase"]=encoder.fit_transform(df["Purchase"])

df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,670,0,0,10,0,2,0,2,7,8,6583
1,2374,0,0,10,0,2,0,0,4,10,11992
2,850,0,0,10,0,2,0,11,7,8,473
3,826,0,0,10,0,2,0,11,12,8,381
4,2732,1,6,16,2,4,0,7,7,8,6182

In [143]:
len(df.columns)

11

In [152]:
columns_x=df.columns
columns_x=columns_x[0:len(columns_x)-1]
x=df[columns_x].values
y=df["Purchase"].values

In [155]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,670,0,0,10,0,2,0,2,7,8,6583
1,2374,0,0,10,0,2,0,0,4,10,11992
2,850,0,0,10,0,2,0,11,7,8,473
3,826,0,0,10,0,2,0,11,12,8,381
4,2732,1,6,16,2,4,0,7,7,8,6182

In [157]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [158]:
from sklearn.linear_model import LinearRegression
reg=LinearRegression()
reg.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [184]:
from sklearn.metrics import mean_absolute_error
#reg.predict(x_train)
y_train
mean_absolute_error(y_train,reg.predict(x_train))/len(df)*100

0.5478457581750509

In [185]:
mean_absolute_error(y_test,reg.predict(x_test))/len(df)*100

0.5494371474751163

In [178]:
#np.abs(y_train-reg.predict(x_train))
#reg.predict(x_train)
y_train

array([ 9090,  3964,  2266, ...,  2424,  7845, 12142], dtype=int64)